package top.cupcupcui.leetcodeproblems.alichengyun;

/**
 * lengthOfLongestSubstring
 *
 * @author cuiguanghao
 * @date 2026/3/24 07:46
 */
public class lengthOfLongestSubstring {

    /**
     * ６、给定一个字符串 s ，请你找出其中不含有重复字符的 最长 子串 的长度。
     * 示例 1:
     * 输入: s = "abcabcbb"
     * 输出: 3
     * 解释: 因为无重复字符的最长子串是 "abc"，所以其长度为 3。注意 "bca" 和 "cab" 也是正确答案。
     * 示例 2:
     * 输入: s = "bbbbb"
     * 输出: 1
     * 解释: 因为无重复字符的最长子串是 "b"，所以其长度为 1。
     * 示例 3:
     * 输入: s = "pwwkew"
     * 输出: 3
     * 解释: 因为无重复字符的最长子串是 "wke"，所以其长度为 3。
     *   请注意，你的答案必须是 子串 的长度，"pwke" 是一个子序列，不是子串。
     * 难度：简单
     */


    /**
     * ６、给定一个字符串 s ，请你找出其中不含有重复字符的 最长 子串 的长度。
     * 正例 :
     * 输入: s = "abcabcbb"
     * 输出: 3
     * 正例 2:
     * 输入: s = "bbbbb"
     * 输出: 1
     * 正例 3:
     * 输入: s = "pwwkew"
     * 输出: 3
     *
     *
     * 正例 :
     * 输入: s = "abcd"
     * 输出: 4
     *
     * 正例 :
     * 输入: s = ""
     * 输出: 0
     * 正例 :
     * 输入: s = " "
     * 输出: 1
     * 正例 :
     * 输入: s = "   "
     * 输出: 1
     * 输入: s = "ab ab"
     * 输出: 3
     * 输入: s = "ab cab "
     * 输出: 3
     */

    /**
     * ６、给定一个字符串 s ，请你找出其中不含有重复字符的 最长 子串 的长度。
     *
     * 方案一思路：
     * 1. 找出所有不含有重复字符的子串。
     * 2. 取所有子串中最长的子串，计算长度。
     *
     * 方案一设计：
     * ** 遍历每个位置 **
     * 1. 遍历字符串 s，每次取当前位置（i）元素为起始元素。
     *
     * ** 获取每个不重复字符子串长度 **
     * 2. 从当前位置（i）遍历字符串 s，将遍历到的元素（j）放入 HashSet 中。
     *   2.1. 如果当前元素在 HashSet 中（说明含有重复字符），则跳出；并记录当前长度 currLen。
     *     2.1.2. 如果 currLen > maxLen，则 maxLen = curLen。
     */


}
