package top.cupcupcui.leetcodeproblems.alichengyun;

/**
 * 后端笔试题：
 *
 * @author cuiguanghao
 * @date 2026/3/20 10:37
 */
public class ProblemList {
    /**
     * problem-list
     *
     * 后端笔试题：
     *
     * 1、根据队列中的元素的优先级实现插队，优先级高的先出队列
     * ，如果优先级相同，入队时间早的先出队，有一个超时时间，如果队列中存在某个元素到达超时时间还未出队，则该队列转变成为普通先入先出队列，直到队列中不存在任何元素后，队列再次变为优先队列；
     *
     * 2、生成100道加减法算术题，加法题和不超过100，加数不能为0，减法题被减数不超过100，结果大于0，随机生成加减法题，不能重复，题目和题目带结果的答案分别写入两个文件；
     *
     * 3、给定一个只包括 '('，')'，'{'，'}'，'['，']' 的字符串 s ，判断字符串是否有效。
     * 有效字符串需满足：
     * 左括号必须用相同类型的右括号闭合。
     * 左括号必须以正确的顺序闭合。
     * 每个右括号都有一个对应的相同类型的左括号。
     *
     * ４、对于两个字符串s和t，我们说"t能整除s"当且仅当s = t + t + t + ... + t + t（即，t被自身连接一次或多次）。
     *
     * 给定两个字符串str1和str2，返回最大的字符串x，使得x既能整除str1也能整除str2。
     * 示例1:
     * 输入:str1="ABCABC"，str2="ABC"输出:"ABC"
     * 示例2:
     * 输入:Str1="ABABAB"，Str2 ="ABAB"输出:"AB"
     * 辗转相除法
     *
     * ５、给定一组非负整数 nums，重新排列每个数的顺序（每个数不可拆分）使之组成一个最大的整数。
     *
     * 注意：
     * 1. 输出结果可能非常大，所以你需要返回一个字符串而不是整数。
     * 2. 注意编码规范性，提供3个以上能直接运行通过的测试用例,注意边界条件
     *
     * 示例 1：
     * 输入：nums = [10,2]
     * 输出："210"
     * 示例 2：
     * 输入：nums = [3,30,34,5,9]
     * 输出："9534330"
     *
     * 提示：
     * 1 〈= nums.length 〈= 100
     *
     * ６、给定一个字符串 s ，请你找出其中不含有重复字符的 最长 子串 的长度。
     * 示例 1:
     * 输入: s = "abcabcbb"
     * 输出: 3
     * 解释: 因为无重复字符的最长子串是 "abc"，所以其长度为 3。注意 "bca" 和 "cab" 也是正确答案。
     * 示例 2:
     * 输入: s = "bbbbb"
     * 输出: 1
     * 解释: 因为无重复字符的最长子串是 "b"，所以其长度为 1。
     * 示例 3:
     * 输入: s = "pwwkew"
     * 输出: 3
     * 解释: 因为无重复字符的最长子串是 "wke"，所以其长度为 3。
     *   请注意，你的答案必须是 子串 的长度，"pwke" 是一个子序列，不是子串。
     *
     * 7、字符串压缩。利用字符重复出现的次数，编写一种方法，实现基本的字符串压缩功能。比如，字符串aabcccccaaa会变为a2b1c5a3。若“压缩”后的字符串没有变短，则返回原先的字符串。你可以假设字符串中只包含大小写英文字母（a至z）。
     * 示例 1：
     * 输入："aabcccccaaa"
     * 输出："a2b1c5a3"
     * 示例 2：
     * 输入："abbccd"
     * 输出："abbccd"
     * 解释："abbccd"压缩后为"a1b2c2d1"，比原字符串长度更长。
     * 提示：
     * 字符串长度在 [0, 50000] 范围内。
     *
     * https://codetop.cc/home
     *
     * 可以结合这个网站里找对应的原题，优先刷我发的题目，然后再刷网站里边筛选阿里巴巴的题目，从前往后刷
     *
     */


}
