package top.cupcupcui.leetcodeproblems.alichengyun;

/**
 * String is valid
 *
 * @author cuiguanghao
 * @date 2026/3/24 09:36
 */
public class StringIsValid {

    /**
     * 3、给定一个只包括 '('，')'，'{'，'}'，'['，']' 的字符串 s ，判断字符串是否有效。
     * 有效字符串需满足：
     * 左括号必须用相同类型的右括号闭合。
     * 左括号必须以正确的顺序闭合。
     * 每个右括号都有一个对应的相同类型的左括号。
     *
     *
     * 示例：
     * "()" true
     * "([])" true
     * "()[]" true
     *
     * "(" false
     * "([)" false
     * "([)]" false
     */

    /**
     * 方案一思路：
     * 1. 遍历字符串 s，使用栈存储元素，比较栈顶元素和当前元素是否匹配
     *
     * 方案一设计：
     * 1. 遍历字符串 s，将元素放入栈中
     * 2. 比较当前元素和栈顶元素，如果匹配成功，则栈顶元素出栈
     * 3. 如果遍历完成后，栈为空
     *      是：字符串有效。
     *      否：字符串无效。
     *
     */

}
